{
    "header":{
        "Welcome_config":"Bienvenido a la configuaracion",
        "Language":"Cambio de idioma",
        "English":"Ingles",
        "Spanish":"Español",
        "Color":"Cambio de color",
        "Dark":"Oscuro",
        "Light":"Claro",
        "Logout":"Cerrar sesión",
        "Home": "Página de inicio",
        "Description":"Descripción de la página",
        "Description_text":"Esta aplicación está diseñada para proporcionar a los usuarios información sobre eventos astronómicos e imágenes. Incluye varias secciones como la Imagen astronómica del día, Eventos, un mapa interactivo y una función personalizada Mis eventos.",
        "Manual":"Manual de usuario",
        "Navigation_Bar": "Barra de navegación",
        "Navigation_Bar_Description": "La barra de navegación permite a los usuarios cambiar fácilmente entre las diferentes secciones de la aplicación.",
        "Map": "Mapa",
        "Map_Description": "La función del mapa permite a los usuarios interactuar con un mapa interactivo del universo, donde pueden hacer clic en planetas u otros cuerpos celestes para verlos como eran en el pasado o cómo serán en el futuro según los datos de la NASA.",
        "Day": "Día",
        "Day_Description": "La sección Día proporciona información diaria y actualizaciones sobre eventos astronómicos.",
        "Events": "Eventos",
        "Events_Description": "En la sección Eventos, los usuarios pueden ver los próximos eventos astronómicos como eclipses solares, eclipses lunares, cometas y asteroides. Los usuarios pueden buscar eventos basados en categorías y rangos de fechas.",
        "My_Events": "Mis Eventos",
        "My_Events_Description": "La función Mis Eventos permite a los usuarios guardar sus eventos favoritos y recibir notificaciones cuando estos eventos ocurren.",
        "Login": "Inicio de sesión",
        "Login_Description": "Los usuarios pueden iniciar sesión en la aplicación para acceder a funciones personalizadas y guardar sus preferencias.",
        "Quick_Links": "Enlaces rápidos",
        "Astronomy_Picture": "Imagen Astronómica",
        "Events_Link": "Eventos",
        "Map_Link": "Mapa",
        "My_Events_Link": "Mis Eventos",
        "Login_Link": "Inicio de sesión",
        "Developer_Information": "Información para desarrolladores",
        "Developer_Info_Text": "Si necesitas soporte o tienes alguna pregunta, por favor contacta a los desarrolladores.",
        "Purpose": "Propósito de la aplicación",
        "Purpose_Text": "Esta aplicación fue creada para proporcionar a los usuarios un acceso fácil a información sobre eventos astronómicos e imágenes, mejorando su conocimiento e interés en la astronomía.",
        "Interactive":"Mapa interactivo",
        "Map_text":"Explora el mapa interactivo para descubrir los cuerpos celestes y sus posiciones en el universo. Haz clic en los planetas u otros objetos para saber más sobre ellos.",
        "Welcome_myEvents":"Bienvenido a tus eventos astronómicos"
    },
    "imageOfTheDay": {
        "Title": "Imagen del Día",
        "SelectDate": "Seleccionar fecha",
        "SelectedDate": "Fecha: {{date}}"
    },
    "events": {
        "Title": "Eventos Astronómicos",
        "StartDate": "Fecha de Inicio",
        "EndDate": "Fecha de Fin",
        "SelectEvent": "Seleccionar Evento:",
        "SolarEclipses": "Eclipses Solares",
        "LunarEclipses": "Eclipses Lunares",
        "Asteroids": "Asteroides",
        "StartDateError": "La fecha de inicio no puede ser anterior al 01-01-1901.",
        "StartDateAfterEndDateError": "La fecha de inicio no puede ser posterior a la fecha de fin.",
        "EndDateError": "La fecha de fin no puede ser posterior al 01-12-2070.",
        "EndDateBeforeStartDateError": "La fecha de fin no puede ser anterior a la fecha de inicio.",
        "DateRangeError": "Selecciona fechas dentro de un rango de 6 meses para ver los resultados de asteroides.",
        "FetchError": "Error al obtener datos: {{message}}",
        "UnknownError": "Error desconocido",
        "Loading": "Cargando...",
        "MoreResults": "Para ver más resultados, debes seleccionar fechas más cercanas.",
        "NoData": "No hay datos disponibles para {{event}}."
    }
}